import { View, Text } from "@tarojs/components";
import "./index.scss";

const UserProtocol = () => {
  return (
    <View className="user-protocol">
      <View className="overflow-hidden p-[20px]">
        <View className="default-text">
          <Text>
            本用户协议双方为货代Go与货代Go平台网络用户（以下简称“用户”），本用户协议具有合同效力。
          </Text>
          <Text>
            货代Go是宁波真和物流科技有限公司开发的产品。（以下简称“货代Go”）。
          </Text>
          <Text>
            货代Go平台指的是系指货代Go合法拥有并运营的、标注名称为“货代Go”的客户端应用程序。
          </Text>
        </View>
        <View className="strong-text">
          <Text>
            在您开始使用货代Go平台之前，请您仔细阅读《货代Go注册用户协议》（以下简称“本协议”），
            特别是涉及免除或者限制责任的条款、权利许可和信息使用的条款、同意开通和使用收费网络服务的条款、法律适用和争议解决条款等重要内容，本协议将以加粗形式提示您注意，您应重点阅读。如您未满18周岁，请您在法定监护人陪同下仔细阅读并充分理解本协议，并征得法定监护人的同意后使用货代Go平台提供的基于互联网和移动网的相关服务(以下称“网络服务”)。
          </Text>
        </View>
        <View className="default-text">
          <Text>
            一旦用户完成注册或使用货代Go平台，即表示用户与货代Go已达成协议，接受本服务协议全部条款，并承诺作为本协议的一方当事人接受协议的约束。
          </Text>
        </View>
        <View className="title-text">
          <Text>第一条 协议条款的确认和接受</Text>
        </View>
        <View className="default-text">
          <Text>
            1.1
            货代Go同意按照中国境内互联网法律、法规之规定、本协议条款约定及货代Go平台不定时发布的操作规则提供网络服务。为获得网络服务，申请人应当认真阅读、充分理解本协议中各条款,
            包括免除或者限货代Go责任的免责条款及对用户的权利限制条款。认真阅读并选择接受或不接受本协议(未成年人应在法定监护人陪同下阅读)。同意接受本协议的全部条款的，申请人应当按照页面上的提示完成全部的注册程序，并在注册程序过程中点击“同意”按钮，否则视为不接受本协议全部条款，申请人应当终止并退出申请。
          </Text>
          <Text>
            1.2
            货代Go有权依运营的需要单方决定，安排或指定其关联公司、控制公司、继承公司或货代Go认可的第三方公司运营货代Go平台。并且，就本协议项下涉及的某些服务，可能会由货代Go的关联公司、控制公司、继承公司或货代Go认可的第三方公司向用户提供。用户知晓并同意接受相关服务内容，即视为接受相关权利义务关系亦受本协议约束。
          </Text>
          <Text>
            1.3
            货代Go有权根据实际运营需要而不定时修改本协议或补充协议，如本协议有任何变更，将通过平台消息或其他方式通知用户。如用户不同意相关变更，则应立即终止帐号使用，否则即视同用户同意并完全接受修订后的协议版本。
            经修订的协议一经公布于货代Go平台链接及页面，立即自动生效，亦成为本协议的一部分。注册用户登录且继续使用服务将被视为已接受修订后的协议。除书面另行声明外，任何扩大的服务范围及新增提供的内容均受本协议约束。
            当发生争议时，应以最新用户协议的内容为准。
          </Text>
        </View>
        <View className="title-text">
          <Text>第二条 用户账号</Text>
        </View>
        <View className="default-text">
          <Text>
            2.1
            用户应通过货代Go为用户提供的合法通道进行注册。用户有权选择合法的字符组合作为自己的账号，并自行设置符合安全要求的密码。注册成功后，用户设置的账号、密码、初始信息是用户使用货代Go平台及相关网络服务的凭证。
          </Text>
          <Text>
            2.2
            基于网络服务的特殊性和国家相关法律法规，用户在使用部分服务时或软件升级时可能被要求提供真实姓名、手机号码、联系邮箱等资料；在上述信息发生变动时，用户应及时更新注册资料。
            如用户提供的资料不合法、不真实、不完整的，用户可能无法使用某些服务。同时，货代Go保留因此拒绝或结束用户使用货代Go平台及相关网络服务资格的权利。
          </Text>
          <Text>
            2.3
            用户所设置的账号不得违反国家法律法规及货代Go的相关规则，用户的账号名称、头像和简介等注册信息及其他个人信息中不得出现违法和不良信息，
            未经他人许可不得用他人名义（包括但不限于以冒用他人姓名、名称、字号、头像等足以让人引起混淆的方式）开设账号，不得恶意注册货代Go平台账号（包括但不限于频繁注册、批量注册账号等行为）。用户在账号注册及使用过程中需遵守相关法律法规，不得实施任何侵害国家利益、损害其他公民合法权益，有害社会道德风尚的行为。货代Go有权对用户提交的注册信息进行审核。
          </Text>
          <Text>
            2.4
            用户注册账号以及利用该帐号所进行的一切活动视为本人的真实意思表示和本人的行为。用户有责任维护个人账号、密码的安全性与保密性，并对以该账号名义所从事的活动承担全部法律责任，包括但不限于在货代Go平台上进行的任何数据修改、言论发表、款项支付等操作行为。
            如用户发现任何非法使用用户账号的情况,
            应立即修改账号密码并妥善保管。因黑客行为或用户的保管疏忽导致帐号非法使用,
            货代Go不承担任何责任。
          </Text>
          <Text>
            2.5
            用户在货代Go平台中的账号所有权及有关权益均归货代Go所有，用户完成注册手续后仅享有该账号的使用权。
            货代Go禁止用户以任何形式赠与、借用、出租、转让、售卖或以其他方式许可他人使用该账号。如果货代Go发现或者有合理理由认为使用者并非账号初始注册人，有权在未通知用户的情况下，暂停或终止向该账号提供服务，并有权注销该账号，而无需向注册该账号的用户承担法律责任。因账号归属产生的用户间的纠纷，货代Go概不负责。货代Go保留追究用户在上述情况下法律责任的权利。
          </Text>
          <Text>
            2.6
            用户应当使用本人名下合法的金融账户（包括银行卡、支付宝、微信、分期产品等）为用户账户充值或行使付款行为。若用户存在使用第三人的金融账号进行充值或付款，或委托第三人代为充值或付款之行为的，则以上行为被视作本人的行为；若由于该第三人行为导致充值或付款行为失败或成功后又被撤销的，均被认为是用户本人真实意思的表示和用户本人实施的行为，由此所造成的一切法律后果均由用户自行承担。因第三人付款产生的任何非货代Go责任的纠纷，货代Go概不负责。
          </Text>
          <Text>
            2.7
            在丢失或遗忘密码后，用户可联系货代Go官方客服及时申诉请求找回账号或密码。用户理解并认可，货代Go的密码找回机制仅需要识别申诉单上所填资料与系统记录资料具有一致性，而无法识别申诉人是否系真正账号有权使用者。
          </Text>
          <Text>
            2.8
            为了充分使用账号资源，货代Go有权对注册后未及时进行初次登录使用、非付费连续90日未登录闲置账号或付费有效期期满后且连续180日未登录闲置账号进行收回处理。
            如账号被收回，用户将可能无法通过此前持有的账号登录并使用货代Go平台及相关网络服务，该账号下保存的任何个性化设置和使用记录将无法恢复。在收回账号之前，货代Go将以适当的方式向用户作出提示，如用户未在相关提示后一定期限内登录、使用账号，货代Go将进行账号收回。
          </Text>
          <Text>
            2.9
            在需要终止使用货代Go平台账号服务时，符合以下条件的，用户可以申请注销用户的货代Go平台账号：
          </Text>
          <Text>
            （1）用户仅能申请注销用户本人的账号，并依照货代Go指示的流程进行注销；
          </Text>
          <Text>
            （2）用户仍应对用户在注销账号前且使用货代Go平台期间的行为承担相应责任；
          </Text>
          <Text>（3）注销成功后，账号记录、功能等将无法恢复或提供。</Text>
          <Text>
            （4）注销成功后，本协议自动终止。如用户需要注销用户的货代Go平台账号，请联系货代Go官方客服，按提示进行注销。
          </Text>
        </View>
        <View className="title-text">
          <Text>第三条 使用规则</Text>
        </View>
        <View className="default-text">
          <Text>
            3.1 用户在使用货代Go网络服务过程中, 必须遵循国家的相关法律法规,
            同时遵循以下规则：
          </Text>
          <Text>（1）不得为任何非法目的而使用货代Go平台；</Text>
          <Text>
            （2）不得以任何形式使用货代Go平台侵犯货代Go的商业利益，包括并不限于发布非经货代Go许可的商业广告；
          </Text>
          <Text>
            （3）不得利用货代Go平台进行任何可能对互联网或移动网络正常运转造成不利影响的行为；
          </Text>
          <Text>
            （4）不得利用货代Go提供的网络服务上传、展示或传播任何虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；
          </Text>
          <Text>
            （5）不得侵犯其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益；
          </Text>
          <Text>（6）不得大量发布重复帖、广告帖、恶意灌水或刷屏；</Text>
          <Text>（7）不得利用货代Go平台进行任何不利于货代Go平台的行为。</Text>
          <Text>
            3.2
            凡用户昵称中出现如下信息者（包括但不限于），货代Go有权进行屏蔽、锁定，甚至注销：
          </Text>
          <Text>
            （1）使用严重违反国家法律法律及风序良俗，包含或暗藏反动、色情等信息（含符号、地址等）的昵称；
          </Text>
          <Text>
            （2）使用党和国家领导人、古今中外比较有影响的名人、网络上知名人士的真实姓名、字、号、艺名、笔名、头衔等为昵称；
          </Text>
          <Text>
            （3）使用国家机构、企事业单位、知名公司或品牌的名称及标识为昵称；
          </Text>
          <Text>（4）含性别歧视、种族歧视、地域歧视等信息的昵称；</Text>
          <Text>
            （5）含自侮辱、猥亵或者对他人进行侮辱、挑衅、漫骂、人身攻击等不文明、不健康信息的昵称；
          </Text>
          <Text>（6）含易产生歧义、引起他人误解的信息的昵称；</Text>
          <Text>
            （7）未获得货代Go官方正式许可而使用带有货代Go相关名称的昵称；
          </Text>
          <Text>
            （8）与货代Go管理人员的昵称近似或雷同，并可能引起混淆或纠纷的；
          </Text>
          <Text>（9）带有明显广告性质的昵称；</Text>
          <Text>（10）带有其它法律法规以及社区规则中所禁止信息的昵称。</Text>
          <Text>
            3.3 货代Go可依其合理判断,
            对违反有关法律法规或本协议约定、或侵犯、妨害、威胁任何人权利或安全的内容,
            或者假冒他人的行为,有权停止传输任何前述内容,
            并有权依其自行判断对违反本条款的任何用户采取适当的法律行动,
            包括但不限于, 删除具有违法性、侵权性、不当性等内容,
            阻止其使用货代Go全部或部分网络服务,
            并且依据法律法规保存有关信息并向有关部门报告等。任何不当用户行为引起的货代Go认为应当终止服务的情况，货代Go有权随时处理，而无须征得用户的同意。
          </Text>
          <Text>
            3.4 对于经由货代Go平台而传送的内容,
            货代Go不保证前述内容的正确性、完整性或品质。用户在接受本服务时,
            有可能会接触到令人不快、不适当或令人厌恶的内容。在任何情况下,
            货代Go均不对任何内容负责,
            包括但不限于任何内容发生任何错误或纰漏以及衍生的任何损失或损害。货代Go有权(但无义务)自行拒绝或删除经由货代Go网络服务提供的任何内容。用户使用上述内容,
            应自行承担风险。
          </Text>
          <Text>
            3.5
            用户通过货代Go平台的网络服务所发布的任何内容并不反映货代Go的观点或政策,
            货代Go对此不承担任何责任。用户须对上述内容的真实性、合法性、无害性、有效性等全权负责,
            与用户所发布信息相关的任何法律责任由用户自行承担, 与货代Go无关。
          </Text>
        </View>
        <View className="title-text">
          <Text>第四条 服务内容</Text>
        </View>
        <View className="default-text">
          <Text>
            4.1
            货代Go利用现有技术上维护整个货代Go平台的正常运行，为用户提供免费或者收费的网络服务，具体内容根据货代Go平台相应页面公示而定。对用户在使用货代Go平台中所遇到的与交易或注册有关的问题及反映的情况，货代Go会及时作出回复。
          </Text>
          <Text>
            4.2
            用户通过本人在货代Go的注册帐号享受相应服务。用户应自行配备上网的所需设备，包括个人电脑、调制解调器或其他必备上网装置；用户应自行负担因使用这种接入方式而产生的上网电话费、上网信息费等费用。
          </Text>
          <Text>
            4.3 对于收费的网络服务,用户需要支付相应费用。
            货代Go会在用户使用之前给予用户明确的提示,
            只有用户根据提示确认并支付相关费用,
            用户才能使用该等收费网络服务。收费网络服务根据付费时的指示，适用货代Go相关收费网络服务协议的约定，具体条款和服务主体以当时指示的为准。
          </Text>
          <Text>
            4.4货代Go将为用户提供货代相关服务，服务内容包含物流信息查询、货代服务预订等功能，服务预订需用户确保登录账号、密码、支付密码正确，所有操作均为用户主动行为，请根据不同产品详细观看产品介绍，预订成功后如果产生相关费用，由用户自行承担。
          </Text>
        </View>
        <View className="title-text">
          <Text>第五条 知识产权</Text>
        </View>
        <View className="default-text">
          <Text>
            5.1 货代Go在货代Go平台中提供的内容
            （包括但不限于软件、技术、程序、网页、文字、图片、图像、音频、视频、图表、版面设计、电子文档等）的知识产权属于货代Go所有。货代Go提供本服务时所依托的软件的著作权、专利权及其他知识产权均归货代Go所有。未经货代Go许可，任何人不得擅自使用（包括但不限于通过任何机器人程序或设备监视、复制、传播、展示、镜像、上载、下载货代Go平台软件及相关服务中的内容）或从事其他任何违反著作权法等相关法律、法规的活动。对侵犯货代Go知识产权的个人和组织，货代Go和作品的著作权人将依法追究其民事及或刑事责任。
          </Text>
          <Text>
            5.2
            用户确认在使用货代Go平台及相关服务时发布上传的文字、图片、视频、音频等均由用户原创或已获合法授权（含转授权）。用户通过货代Go平台上传、发布的任何内容的知识产权归属用户或原始著作权人所有。
          </Text>
          <Text>
            5.3
            用户理解并同意对上述5.2条用户上传的内容，授予货代Go及其关联公司、继承公司全球范围内、免费、非独家、可再许可（通过多层次）的权利（包括但不限于复制权、翻译权、汇编权、信息网络传播权、改编权、制作衍生品等），使用范围包括但不限于在当前或其他网站、应用程序、产品或终端设备等。用户在此确认并同意，上述权利的授予包括货代Go和或货代Go品牌有关的任何推广、广告、营销和或宣传中使用和以其他方式开发内容(全部或部分)的权利和许可。为避免疑惑，用户同意，上述权利的授予包括使用、复制和展示用户拥有或被许可使用并植入内容中的个人形象、肖像、姓名、商标、服务标志、品牌、名称、标识和公司标记(如有)以及任何其他品牌、营销或推广资产的权利和许可。
          </Text>
          <Text>
            5.4
            用户理解并同意用户通过货代Go平台了解并自愿自主参与的货代Go或者发布在货代Go平台上的第三方组织、举办的线上、线下活动中，货代Go可以进行拍照、摄像、录音、录像等记录活动。货代Go对上述记录活动过程中所产生的作品、录音录像作品等单独地享有全部、完整的知识产权。用户以此授予货代Go及其关联公司独家的、全球通用的、永久的、免费的许可使用权利
            (并有权在多个层面对该权利进行再授权)，使货代Go及其关联公司有权(全部或部份地)
            使用、复制、修订、改写、发布、翻译、分发、执行和展示用户的全部资料数据（包括但不限于注册资料、交易行为数据及全部展示于平台的各类信息）或制作其派生作品，和或以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其它作品内；用户同意，上述权利的授予包括使用、复制和展示用户拥有或被许可使用并植入内容中的个人形象、肖像、姓名、声音、个人经历等。
          </Text>
          <Text>
            5.5用户确认并同意授权货代Go以自己的名义或委托专业第三方对侵犯用户上传发布的享有知识产权的内容进行代维权，维权形式包括但不限于：监测侵权行为、发送维权函、提起诉讼或仲裁、调解、和解等，货代Go有权对维权事宜做出决策并独立实施。
          </Text>
          <Text>
            5.6
            货代Go为货代Go平台及其相关服务的开发、运营提供技术支持，并对货代Go平台及其相关服务的开发和运营等过程中产生的所有数据和信息等享有全部权利。
          </Text>
          <Text>
            5.7
            用户在任何情况下都不得私自使用货代Go的包括但不限于货代Go平台在内的任何商标、服务标记、商号、域名、网站名称或其他显著品牌特征等（以下统称为“标识”）。未经货代Go事先书面同意，用户不得将本条款前述标识以单独或结合任何方式展示、使用或申请注册商标、进行域名注册等，也不得实施向他人明示或暗示有权展示、使用、或其他有权处理该些标识的行为。由于用户违反本协议使用货代Go上述商标、标识等给货代Go或他人造成损失的，由用户承担全部法律责任。
          </Text>
          <Text>
            5.8
            如用户发现货代Go平台APP内存在任何侵犯用户权利的内容，可以根据货代Go《版权政策和侵权投诉指引》中的指示通知货代Go，提供用户有相关权利的初步证据，货代Go将会根据当地法律规定及时处理用户的投诉。
          </Text>
        </View>
        <View className="title-text">
          <Text>第六条 免责条款</Text>
        </View>
        <View className="strong-text">
          <Text>
            6.1
            用户明确同意其使用货代Go网络服务所存在的风险将完全由其自己承担；因其使用货代Go网络服务而产生的一切后果也由其自己承担，货代Go对用户不承担任何责任。
          </Text>
          <Text>
            6.2
            货代Go不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。
            因货代Go的过错造成服务中断或停止，货代Go应当及时处理，但对用户因此所遭受的货代Go在本协议生效时无法预见的间接损失、预期利益损失等，货代Go不承担责任。
          </Text>
          <Text>
            6.3
            货代Go不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由货代Go实际控制的任何网页上的内容，货代Go不承担任何责任。
          </Text>
          <Text>
            6.4
            对于因不可抗力或货代Go不能控制的原因造成的网络服务中断或其它缺陷，货代Go不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。
          </Text>
          <Text>
            6.5
            货代Go平台及用户上传的相关信息为建议性内容，仅供参考，不做指导性意见。对于货代Go向用户提供的下列产品或者服务的质量缺陷本身及其引发的任何损失，货代Go无需承担任何责任：
          </Text>
          <Text>（1）货代Go向用户免费提供的各项网络服务；</Text>
          <Text>（2）货代Go向用户赠送的任何产品或者服务；</Text>
          <Text>（3）货代Go向收费网络服务用户附赠的各种产品或者服务；</Text>
          <Text>
            6.6
            货代Go用户(或网友)所上传的相片、文章或讨论区发言内容，由该用户(或网友)自行对该相片、文章或讨论区发言内容担保其知识性、专业性以及合法性。
          </Text>
          <Text>
            6.7
            货代Go不就由在货代Go平台上产生或在传送或递交全部或部分上述资料过程中产生的延误、不准确、错误和遗漏或从中产生或由此产生的任何损害赔偿,
            以任何形式, 向用户或任何第三方负责。
          </Text>
          <Text>
            6.8
            用户在货代Go平台支付时选择的第三方支付方式，在支付过程中因用户自身原因或第三方支付平台原因造成的异常使其账户无法正常使用或遭受损失，由用户自行承担。
          </Text>
        </View>
        <View className="title-text">
          <Text>第七条 服务的中断和终止</Text>
        </View>
        <View className="default-text">
          <Text>
            7.1
            鉴于网络服务的特殊性，用户同意货代Go有权随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。
          </Text>
          <Text>
            （1）如变更、中断或终止的网络服务属于免费网络服务，货代Go无需通知用户，也无需对任何用户或任何第三方承担任何责任；如变更、中断或终止的网络服务属于收费网络服务，货代Go应当在变更、中断或终止之前事先通知用户，并应向受影响的用户提供等值的替代性的收费网络服务；
          </Text>
          <Text>
            （2）中断服务情况下,如用户不愿意接受替代性的收费网络服务，就该用户已经向货代Go支付的服务费，货代Go应当按中断服务天数收费协议服务天数比例退还相应服务费给该用户。货代Go不对因此产生的第三方或者间接损失承担任何责任。
          </Text>
          <Text>
            （3）终止服务情况下,如用户不愿意接受替代性的收费网络服务，就该用户已经向货代Go支付的服务费，货代Go应当按照该用户实际使用相应收费网络服务的情况扣除相应服务费之后将剩余的服务费退还给该用户，本协议终止。货代Go不对因此产生的第三方或者间接损失承担任何责任。
          </Text>
          <Text>
            7.2
            用户理解，货代Go需要定期或不定期地对提供网络服务的平台（如移动网络等）或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，货代Go无需为此承担任何责任，但货代Go应尽可能事先进行通告。
          </Text>
          <Text>
            7.3
            如发生下列任何一种情形，货代Go有权随时中断或终止向用户提供本协议项下的网络服务（包括收费网络服务）而无需对用户或任何第三方承担任何责任：
          </Text>
          <Text>（1）用户提供的个人资料不真实；</Text>
          <Text>（2）用户违反本协议中规定的使用规则；</Text>
          <Text>
            （3）用户在使用收费网络服务时未按规定向货代Go支付相应的服务费。
          </Text>
        </View>
        <View className="title-text">
          <Text>第八条 隐私声明</Text>
        </View>
        <View className="default-text">
          <Text>
            8.1
            货代Go非常重视用户信息的保护，保护用户个人信息是货代Go的基本原则之一。货代Go与用户一同致力于用户个人信息（即能够独立或与其他信息结合后识别用户身份的信息）的保护。
          </Text>
          <Text>
            8.2
            为了为用户提供更好的服务和相应的技术支持，用户同意货代Go可将用户注册资料及使用信息提供货代Go及其关联公司使用。
            用户理解并同意，货代Go有权在遵守法律法规、本协议以及货代Go《隐私政策》的前提下，收集、使用（含商业合作使用）、存储和分享用户的个人信息，同时，货代Go将依法保护用户浏览、修改、删除相关个人信息以及撤回同意的权利。
          </Text>
          <Text>
            8.3
            用户同意：货代Go或其关联公司在必要时有权根据用户注册时或接受服务时所提供的联系信息（包括但不限于电子邮件地址、联系电话、联系地址、即时聊天工具账号等），通过电子邮件、电话、短信、邮寄、即时聊天、弹出页面等方式向用户发送如下信息：
          </Text>
          <Text>
            （1）各类重要通知信息，可能包括但不限于订单、交易单、修改密码提示等重要信息。此类信息可能对用户的权利义务产生重大的有利或不利影响，用户务必及时关注。
          </Text>
          <Text>
            （2）商品和服务广告、促销优惠等商业性信息。若用户不愿意接收此类信息，则可通过告知（书面）的方式通知货代Go或其关联公司取消发送，亦可通过货代Go或其关联公司所提供的相应退订功能（若有）进行退订。
          </Text>
          <Text>
            8.4 用户可随时浏览、修改自己提交的个人身份信息，
            用户理解并同意出于安全性和身份识别（如账号或密码找回申诉服务等）的考虑，用户可能无法修改注册时提供的初始注册信息及其他验证信息。
          </Text>
          <Text>
            8.5
            货代Go将运用与货代Go平台及相关服务相匹配的安全技术及其他安全措施，并建立完善的管理制度来保护用户的个人信息，防止用户的信息被不当使用或被未经授权的访问、使用或泄漏。
          </Text>
          <Text>
            8.6
            未经用户的同意，货代Go不会向货代Go以外的任何公司、组织和个人披露用户的个人信息，下列情形除外：
          </Text>
          <Text>（1）事先获得用户的明确授权同意；</Text>
          <Text>（2）用户自行向其他公司、组织和个人共享、转让、公开的；</Text>
          <Text>
            （3）与国家安全、国防安全、公共安全、公共卫生、公共利益直接相关的；
          </Text>
          <Text>
            （4）根据适用的法律法规的要求、强制性的行政和司法要求所必须的情况下进行披露或提供，或与犯罪侦查、起诉、审判和判决执行等直接相关的。在符合法律法规的前提下，当货代Go收到前述披露信息的请求时，货代Go会要求对方必须出具与之相应的法律文件，如传票或调查函。货代Go将对所有的请求都进行了审慎的审查，以确保其具备合法依据，且仅限于行政、司法部门因特定调查目的有合法权利获取的数据；
          </Text>
          <Text>
            （5）在法律法规允许的范围内，为维护货代Go其他用户、公司及其关联公司、控制公司的生命、财产等合法权益或维权产品或服务的安全稳定运行所必需的，例如查找、预防、处理欺诈等违法活动和减少信用风险等(不)括违反本协议中所做的承诺而为获利目的对外公开或提供个人信息）；
          </Text>
          <Text>
            （6）从合法公开披露的信息中获得的个人信息，如合法的新闻报道、政府信息公开等渠道；
          </Text>
          <Text>（7）法律法规规定的其他情形。</Text>
          <Text>
            8.7
            请用户注意勿在使用货代Go平台及相关服务中透露自己的各类财产账户、银行卡、信用卡、第三方支付账户及对应密码等重要资料，否则由此带来的任何损失由用户自行承担。
          </Text>
          <Text>
            8.8
            考虑到货代Go平台及相关服务中可能包括或链接至第三方提供的信息或其他服务（包括网站）。用户知悉并理解，运营该等服务的第三方可能会要求用户提供个人信息。货代Go特别提醒用户，需要认真阅读该等第三方的用户协议、隐私政策以及其他相关的条款，妥善保护自己的个人信息，仅在必要的情况下向该等第三方提供。本协议（以及其他与货代Go服务相关的协议和规则（包括但不限于货代Go《隐私政策》）不适用于任何第三方提供的服务，货代Go对任何因第三方使用由用户提供的个人信息所可能引起的后果不承担任何法律责任。更多关于用户个人信息保护的内容，请参看货代Go《隐私政策》。
          </Text>
        </View>
        <View className="title-text">
          <Text>第九条 违约处理</Text>
        </View>
        <View className="default-text">
          <Text>
            9.1
            针对用户违反本协议或其他服务条款的行为，货代Go有权独立判断并视情况采取预先警示、拒绝发布、立即停止传输信息、删除跟帖、音频、视频等内容、短期禁止发言、限制账号部分或者全部功能直至永久关闭账号等措施。货代Go有权公告处理结果，且有权根据实际情况决定是否恢复使用。对涉嫌违反法律法规、涉嫌违法犯罪的行为将保存有关记录，并依法向有关主管部门报告、配合有关主管部门调查。对已删除内容货代Go有权不予返还。
          </Text>
          <Text>
            9.2
            因用户违反本协议或其他服务条款规定，引起第三方投诉或诉讼索赔的，用户应当自行承担全部法律责任。因用户的违法或违约行为导致货代Go向任何第三方赔偿或遭受国家机关处罚的，用户还应足额赔偿货代Go因此遭受的全部损失。
          </Text>
          <Text>
            9.3
            货代Go尊重并保护法人、公民的知识产权、名誉权、姓名权、隐私权等合法权益。
            用户保证，在使用货代Go平台及相关服务时上传的文字、视频、音频、链接等不侵犯任何第三方的知识产权、名誉权、姓名权、隐私权等权利及合法权益。否则，货代Go有权在收到权利方或者相关方通知的情况下移除该涉嫌侵权内容。针对第三方提出的全部权利主张，用户应自行承担全部法律责任；如因用户的侵权行为导致货代Go遭受损失的（包括但不限于经济、商誉等损失），用户还应足额赔偿货代Go遭受的全部损失。
          </Text>
        </View>
        <View className="title-text">
          <Text>第十条 法律与管辖</Text>
        </View>
        <View className="default-text">
          <Text>
            10.1
            本协议的成立、生效、履行、解释及争议的解决均应适用中华人民共和国大陆地区法律。倘若本协议之任何规定因与中华人民共和国大陆地区的法律抵触而无效，则这些条款将尽可能接近本协议原条文意旨重新解析，且本协议其它规定仍应具有完整的效力及效果。
          </Text>
          <Text>
            10.2
            本协议的签署地点为中华人民共和国浙江省宁波市，若用户与智能订舱发生争议的，双方应尽量友好协商解决，协商不成，用户同意应将争议提交至上海市国际仲裁中心依该会当时适用的仲裁规则仲裁解决。如争议金额在人民币50万元以内的，应适用简易程序。
          </Text>
          <Text>
            10.3
            本协议中的标题仅为方便及阅读而设，并不影响本协议中任何规定的含义或解释。
          </Text>
          <Text>
            10.4
            用户和货代Go均是独立的主体，在任何情况下本协议不构成货代Go对用户的任何形式的明示或暗示担保或条件，双方之间亦不构成代理、合伙、合营或雇佣关系。
          </Text>
          <Text>（完）</Text>
        </View>
      </View>
    </View>
  );
};

export default UserProtocol;
