import { View, Text } from "@tarojs/components";
import "./index.scss";

const Privacy = () => {
  return (
    <View className="privacy">
      <View className="container">
        <View className="default-text">
          <Text>
            本用户协议双方为货代Go与货代Go平台网络用户（以下简称“用户”），本用户协议具有合同效力。
          </Text>
          <Text>货代Go是开发的产品。（以下简称“货代Go”）。</Text>
          <Text>
            货代Go将保护用户隐私作为一项基本政策。您在使用货代Go的产品与/或服务时，货代Go可能会收集和使用您的相关信息。
            本隐私政策将向您说明货代Go如何收集、使用、保存、共享和转让这些信息。
            如您正在使用货代Go的关联公司、合作伙伴/
            机构之产品或服务的，则本政策同样适用于该部分产品或服务。
          </Text>
        </View>
        <View className="strong-text">
          <Text>
            本隐私政策与您在使用货代Go提供的服务以及该服务所包括的各种功能（以下简称为
            “货代Go的产品与/或服务”）
            关系紧密，请您在使用货代Go的产品与/或服务前仔细阅读并完整理解本隐私政策的全部内容，并做出您认为适当的选择。
          </Text>
        </View>
        <View className="default-text">
          <Text>
            本隐私政策可能涉及的相关术语，货代Go会尽量采用通俗易懂的表述方式，以便您可以更好的理解。尤其请您注意行文中用
            <Text style="font-weight: bold;">粗体字</Text>
            或下划线字标出的内容/条款，这些内容/条款和您的权益有着重大的关系。{" "}
          </Text>
        </View>
        <View className="strong-text">
          <Text>
            您使用或在货代Go更新本隐私政策后继续使用货代Go的产品与/或服务，即表示您已同意本隐私政策的内容，并同意货代Go按照本隐私政策收集、使用、保存和共享您的相关信息。
          </Text>
        </View>
        <View className="default-text">
          <Text>
            货代Go深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。货代Go致力于维持您对货代Go的信任，
            恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则
            、公开透明原则等。同时，货代Go承诺，货代Go将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
          </Text>
        </View>
        <View className="title-text">
          <Text>一、货代Go如何收集和使用个人信息</Text>
        </View>
        <View className="default-text">
          <Text>（一） 来自您的主动授权</Text>
          <Text>
            您可能会在某些场景中，主动向货代Go提供个人信息以获得更加完整的功能体验，货代Go会在相应的功能中提供信息提交的入口。若您不提供这类信息，您依然可以正常使用货代Go的其他相关服务，但与之对应的功能则可能无法使用。例如：
          </Text>
          <Text>
            (1) 拨打电话功能。货代Go会
            <Text style="font-weight: bold;">使用拨打电话功能，</Text>
            来满足您的客服服务、建议投诉等需要。货代Go设置24小时在线客服电话，及时响应用户问题。
          </Text>
          <Text>
            (2)
            以及其他一些货代Go的应用程序或网页显示向您征询许可授权收集、使用个人信息的附加功能。
          </Text>
          <Text>
            上述功能可能需要您在您的设备中向货代Go的网站、应用程序开启相应的访问权限。（若您的设备/操作系统支持）您随时可以自主地决定是否开启或关闭上述功能。
            请您注意，一旦您开启了相关权限或提交了相关信息，即视为您已主动向货代Go授权收集和使用上述信息。如果您关闭了相关权限，即代表您取消了这些授权，货代Go将不再继续收集使用您的这些个人信息。您关闭权限的决定不会影响此前基于您的授权所进行的个人信息的处理。
          </Text>
          <Text style="font-weight: bold;">
            特别需要指出的是，即使经过您的授权，我们获得了这些敏感权限，也不会在相关功能或服务不需要时而收集您的信息。
          </Text>
          <Text>（二） 因货代Go向您提供产品与/或服务时所必需的</Text>
          <Text>
            在您使用货代Go的产品与/或服务时，应产品或服务的功能本身、改进产品或服务的功能以及保障产品或服务的安全、合规，
            货代Go可能会收集、保存和使用下列与您有关的信息来实现上述的功能，如果您不提供相关信息，您将无法享受货代Go的产品与/或服务。
            这些功能主要包括：
          </Text>
          <Text>
            (1)用户注册、登录
            您在使用货代Go提供的绝大部分产品与/或服务前，需要先注册成为货代Go的用户。在您注册成为货代Go的用户时，
            您需要至少向货代Go提供您的昵称、密码、您本人的手机号码或您的邮箱地址，货代Go将通过发送短信验证码或邮件验证的方式验证您的身
            份是否有效。
            您也可以使用第三方账号（如微信、QQ等）登录，您此时将授权货代Go获取您在第三方平台注册的公开信息（头像、昵称等），
            并在您同意本隐私政策后将您的第三方账号与您的货代Go账户绑定，使您可以通过第三方账号直接登录并使用货代Go的产品与/或服务。
          </Text>
          <Text>
            (2)
            上述信息与来自货代Go的其他服务的信息结合，进行综合统计并通过算法做特征与偏好分析，用以向您进行个性化推荐、
            展示或推送您可能感兴趣的特定音视频、课程等信息，或者推送更合适您的特定功能或服务。
            货代Go收集、使用上述信息时进
            行了去标识化处理，数据分析仅对应特定的、无法直接关联用户身份的编码，无法也绝不会与您的真实身份相关联。
          </Text>
          <Text>
            (3) 购买支付
            当您准备购买货代Go提供的商品或服务时，或您准备购买由货代Go的关联公司、合作伙伴/机构提供的商品或服务时，
            货代Go的系统会生成您的购买订单。此过程可能会要求您填写姓名、联系方式，同时订单中会载明您的订单号、购买的商
            品或服务信息、应当支付的金额和支付方式等。
            上述信息构成您的订单信息，货代Go会使用您的订单信息来进行身份核验、确定交易、支付结
            算、配送、咨询售后，货代Go还会使用订单信息来判断您的交易是否存在异常以保护您的交易安全。
          </Text>
          <Text>
            (4) 客服售后
            货代Go的系统或客服人员会通过用户注册时或接受服务时所提供的联系信息（包括但不限于电子邮件地址、联系电话、
            联系地址、即时聊天工具账号等），通过电子邮件、电话、短信、邮寄、即时聊天、弹出页面等方式跟用户取得联系。
          </Text>
          <Text>
            (5) 服务改进
            货代Go可能会收集您的个人信息进行数据分析用以为您提供个性化定制的服务，或用其为货代Go的服务进行未来的改进和调整。
          </Text>
          <Text>
            (6) 开展营销活动
            当你选择参加货代Go或货代Go的关联公司、合作伙伴/机构举办的有关营销活动时，根据活动需要，你可提供姓名、通信地址、联系方式、银行账号等信息。这些信息中可能包含个人敏感信息（如个人电话号码、银行账号等），
            是你收到转账或者礼品所必要的，如果你拒绝提供这些信息，货代Go将可能无法向你转账或发放礼品。
          </Text>
          <Text>
            (7) 保障安全
            为提高您使用货代Go的产品与/或服务时系统的安全性，更准确地预防钓鱼网站欺诈和保护账户安全，货代Go可能会通过了解您的浏览信息、订单信息、您常用的软件信息、设备信息、用户行为信息等手段来判断您的账号风险，
            并可能会记录一些技术判断为异常的链接地址；货代Go也会收集您的设备信息用作问题进行分析，统计流量并排查可能存在的风险。
          </Text>
          <Text>（三） 收集、使用信息且无需征得您的同意的情形</Text>
          <Text>
            您充分知晓，在以下情形中货代Go收集、使用个人信息无需征得您的授权和同意：
          </Text>
          <Text>(1) 与国家安全、国防安全有关的；</Text>
          <Text>(2) 与公共安全、公共卫生、重大公共利益有关的；</Text>
          <Text>(3) 与犯罪侦查、起诉和审判等有关的；</Text>
          <Text>(4) 有充分证据证明您存在主观恶意或滥用权利的；</Text>
          <Text>
            (5) 响应您的请求将导致其他个人、组织的合法权益受到严重损害的；
          </Text>
          <Text>
            (6)
            出于维护个人信息主体或其他个人的生命、财产等重大合法权益，但又很难征得本人同意的；
          </Text>
          <Text>(7) 信息主体主动向社会公众公开的；</Text>
          <Text>(8) 用于维护所提供的产品与/或服务的安全稳定运行所必需的；</Text>
          <Text>(9) 应国家有权机关的要求的；</Text>
          <Text>(10) 法律法规规定的其他情形。</Text>
          <Text>（四） 来自于第三方的个人信息</Text>
          <Text>货代Go可能从第三方获取您授权共享的个人信息，例如：</Text>
          <Text>
            (1)
            从第三方登录带来您的头像、第三方登录账号、昵称等信息，并在您同意本政策后将这部分信息与您的账号绑定。
          </Text>
          <Text>
            (2)
            用户因使用货代Go的产品或者服务而被货代Go收集的信息，例如其他用户发布的信息中可能含有你的部分信息（如：在评论、留言、发布图文、音视频中涉及到与你相关的信息）。
          </Text>
          <Text>
            (3)
            在你使用货代Go产品及相关服务提供的身份认证功能时，货代Go会根据相关法律法规规定和/或该身份认证功能（例如：芝麻认证）所必需，货代Go将采用行业内通行的
            方式及尽最大的商业努力来保护你个人敏感信息的安全。如果你不提供这些信息，你将可能无法获得相关服务。
          </Text>
          <Text>
            货代Go将会依据与第三方的协议，对个人信息来源的合法性进行确认后，在符合相关法律法规的前提下使用您的这些个人信息。
          </Text>
          <Text>（五） 个人信息的匿名化使用</Text>
          <Text>
            在收集您的个人信息后，货代Go将通过技术手段对数据进行匿名化处理，匿名化处理的信息将无法识别主体。请您了解并同意，
            在此情况下货代Go有权使用已经匿名化的信息；并在不透露您个人信息的前提下，货代Go有权对用户数据库进行分析并予以商业化的利用。
          </Text>
        </View>
        <View className="title-text">
          <Text>二、货代Go如何使用Cookie和同类技术</Text>
        </View>
        <View className="default-text">
          <Text>
            在您使用货代Go的产品与/或服务时，货代Go可能会通过数据文件标识您的身份，这些向您设备发送的一个或多个数据文件是唯一的，
            只能被货代Go的服务器读取和使用。这些数据文件可能是Cookie/Flash
            Cookie或其他类似的技术。向您发送这类数据文件的目的，
            是为了简化您的登录步骤、存储您的相关偏好设置、帮助判断您的登录状态和为了保卫您的账号、数据安全等。
          </Text>
          <Text>
            您可以根据自己的偏好或浏览器、操作系统的设置自行管理或删除这类数据文件。例如，您可以清除计算机上保存的Cookie，您也可以设置浏览器拒绝接受Cookie等。
            一旦您实施了这个“清除”操作，则在某些情况下您可能会被重复的要求验证身份，或者影响您安全访问货代Go的产品与/或服务。
          </Text>
        </View>
        <View className="title-text">
          <Text>三、货代Go如何共享、转让、公开披露个人信息</Text>
        </View>
        <View className="default-text">
          <Text>（一）个人信息的共享、转让</Text>
          <Text>
            货代Go不会向第三方共享、转让你的个人信息，除非经过你本人事先授权同意，
            或者共享、转让的个人信息是去标识化处理后的信息，且共享第三方无法重新识别此类信息的自然人主体。
          </Text>
          <Text>(1)在下列情况下，货代Go可能会共享的个人信息</Text>
          <Text>
            （1）为实现程序化广告推送，货代Go可能会与关联公司或第三方合作伙伴共享去标识化或匿名化处理后的信息。
            货代Go可能与关联公司或第三方合作伙伴共享信息，但货代Go不会分享用于识别你个人身份的信息，例如你的姓名、身份证号等，
            仅会向这些合作伙伴提供难以识别你个人身份的用户画像标签及去标识化或匿名化后的统计类信息，以帮助其在不识别你个人身份的前提下提升推送、
            广告有效触达率。
          </Text>
          <Text>
            （2）为实现特定功能而与业务合作伙伴共享。
            当软件服务提供商、智能设备提供商或系统服务提供商与货代Go联合为你提供服务时，
            例如你需要使用地理位置功能时，为实现这一功能，货代Go可能会收集你的位置信息及相关设备信息（例如硬件型号、操作系统版本号、
            国际移动设备身份识别码（IMEI）、网络设备硬件地址（MAC））经过去标识化后并提供给前述提供商。你可以拒绝提供此类信息，
            但不影响你使用其他服务。为了识别设备/账号异常状态，我们将会接受并记录您所使用的设备相关信息（包括设备型号、操作系统、设备设置、唯一设备标识符（IMEI码）、网络设备硬件地址（MAC）、设备环境等软硬件特征信息，设备所在位置相关信息（包括您授权的GPS位置以及WLAN接入点、蓝牙和基站等信息）
          </Text>
          <Text>
            （3）帮助你参加营销推广活动
            当你选择参加货代Go举办的有关营销活动时，根据活动需要你可提供姓名、通信地址、联系方式、
            银行账号等信息，以便第三方能及时向你提供奖品。当你选择参加货代Go举办的有关营销活动时，根据活动需要你可提供姓名、通信地址、
            联系方式、银行账号等信息。经过你的明示同意，货代Go会将上述信息与第三方共享，以便货代Go能委托第三方及时向你提供奖品。
          </Text>
          <Text>(2)对共享个人信息第三方主体的谨慎评估及责任约束。</Text>
          <Text>
            （1）经你同意，货代Go只会与第三方共享实现目的所必要的信息。如果第三方因业务需要，确需超出前述授权范围使用个人信息的，该第三方将需再次征求你的同意。
          </Text>
          <Text>
            （2）对货代Go与之共享你个人信息的第三方，该些第三方会与货代Go签订保密协议。同时，货代Go会对其数据安全能力与环境进行评估并要求第三方以不低于本隐私政策所要求的保密和安全措施来处理该些信息。
          </Text>
          <Text>（3）收购、兼并、重组时个人信息的转让。</Text>
          <Text>
            随着货代Go业务的持续发展，货代Go将有可能进行合并、收购、资产转让，你的个人信息有可能因此而被转移。在发生前述变更时，货代Go将按照法律法规及不低于本隐私政策所要求的安全标准继续保护或要求个
            人信息的继受方继续保护你的个人信息，否则货代Go将要求继受方重新征得你的授权同意。
          </Text>
          <Text>（二）个人信息的公开披露</Text>
          <Text>
            除对违规账号、欺诈行为进行处罚公告时，货代Go会披露相关账号的必要信息外，货代Go不会公开披露你的信息，除非遵循国家法律法规规定或者获得你的同意。货代Go公开披露你的个人信息会采用符合行业内标准的安全保护措施。
          </Text>
          <Text>（三）依法豁免征得同意共享、转让、公开披露的个人信息</Text>
          <Text>
            请你理解，在下列情形中，根据法律法规及国家标准，货代Go共享、转让、公开披露你的个人信息无需征得你的授权同意
          </Text>
          <Text>（1）与国家安全、国防安全直接相关的；</Text>
          <Text>（2）与公共安全、公共卫生、重大公共利益直接相关的；</Text>
          <Text>（3）与犯罪侦查、起诉、审判和判决执行等直接相关的；</Text>
          <Text>
            （4）出于维护你或其他个人的生命、财产等重大合法权益但又很难得到你的同意的；
          </Text>
          <Text>（5）你自行向社会公众公开的个人信息；</Text>
          <Text>
            （6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
          </Text>
        </View>
        <View className="title-text">
          <Text>四、货代Go如何存储和保护个人信息</Text>
        </View>
        <View className="default-text">
          <Text>
            （一）
            除非另有约定或法律另有规定，货代Go在中华人民共和国境内收集和产生的个人信息将储存在中华人民共和国境内。
            对在中华人民共和国境外收集和产生的个人信息，货代Go将按照中华人民共和国认可效力的法律、法规、国际规则或国际惯例予以存储。
          </Text>
          <Text>
            (二)货代Go向您承诺，货代Go将使用以下措施，使得信息安全保护达到合理的水平：
          </Text>
          <Text>(1) 技术措施</Text>
          <Text>
            货代Go会采用符合行业标准的安全保护措施，包括对网络服务采用传输层安全协议等加密技术，确保用户数据在传输过程中的安全，
            并通过隔离技术对存储的数据进行隔离。
            在部分使用您个人信息的场景中（例如个人信息展示、个人信息确认等），
            货代Go会采用包括内容替换、单向哈希在内等多种数据脱敏技术增强您的个人信息在使用中的安全性。
            货代Go亦采用了严格
            的访问权限控制、多因子身份认证等技术保护您个人信息，避免数据被违规获取。
          </Text>
          <Text>(2)访问规范</Text>
          <Text>
            货代Go建立了信息安全制度、数据分级管理规范、安全/开发规范等制度规范来管理您个人信息的存储、访问和使用。
            货代Go对信息接触者签署了保密协议，并应用了访问日志、行为监控和专门的审计措施来对数据进行全面的管控。
          </Text>
          <Text>(3)其他保护方式</Text>
          <Text>
            在员工安全意识培养上，货代Go会定期举办安全、隐私相关的宣讲培训、考试。
            货代Go也只允许必要知晓这些信息的货代Go及货代Go关联公司的员工、合作伙伴访问、接触个人信息，
            并适用上文提到的所有技术措施和规范限制。货代Go要求相关的人员必须履行相关的保密义务，如果未能履行这些义务，
            则其可能会被解雇或中止与货代Go的合作关系，直至追究其法律责任。
          </Text>
          <Text>
            (三)
            互联网环境不是绝对安全的环境，您通过各种交流方式与其他用户的交流无法确定是否已经得到了适当的保护。
            货代Go建议您在使用其他交流工具时，注意保护个人信息安全，不要泄露个人信息或您的账户私密信息，同时在相关工具上启用复杂的密码。
          </Text>
          <Text>
            (四)
            请您理解，由于技术水平限制及可能存在的各种恶意手段，有可能因为货代Go可控范围外的因素而出现问题。
            根据法律法规的要求，在不幸发生个人信息安全事件后，货代Go将尽力及时向您告知：安全事件的基本情况和可能的影响；
            货代Go已经采取或即将采取的处置措施；您可以自主防范和降低风险的建议；对您的补救措施等。货代Go同事会及时将事件相关情况以邮件
            、信函、电话、推送通知、站内消息等方式告知您。如果难以逐一告知个人信息主体时，货代Go会采取合理、有效的方式发布公告，
            并按照监管部门的要求，主动上报个人信息安全事件的处置状况。
          </Text>
          <Text>
            (五)
            货代Go谨此特别提醒你，本隐私政策提供的个人信息保护措施仅适用于货代Go平台及相关服务。一旦你离开货代Go平台及相关服务，
            浏览或使用其他第三方网站、服务及内容资源，我们即没有能力及义务保护你在货代Go软件及相关服务之外的软件、网站提交的任何个人信息，
            无论你登录、浏览或使用上述软件、网站是否基于货代Go平台的链接或引导。
          </Text>
        </View>
        <View className="title-text">
          <Text>五、您如何管理您的个人信息</Text>
        </View>
        <View className="default-text">
          <Text>
            （一）
            货代Go将尽力保护您对于您个人信息的访问、更新、更正您个人信息的权利，除法律法规规定的情形外，您有权随时行使这个权利。
            但出于安全性和身份识别的考虑，你可能无法自主修改注册时提交的某些初始注册信息（如注册邮箱、实名认证后信息等）。
          </Text>
          <Text>
            （二）
            你可以根据《货代Go用户服务协议》第2.9条申请注销你的账号。在你注销账号前，我们将验证你的个人身份、
            安全状态、设备信息等。
            你知悉并理解，注销账号的行为是不可逆的行为，当你注销账号后，
            我们将删除有关你账号的一切信息或对相关信息进行匿名化处理，但法律法规另有规定的除外。
          </Text>
          <Text>
            您可以通过以下方式申请注销你的账户：联系客户，提交账户注销申请，在您主动注销账户之后，我们立刻将停止为您提供产品或服务，根据适用法律的要求删除您的个人信息，或使其匿名化处理。
          </Text>
          <Text>
            【特别提示】在此善意提醒你，注销货代Go账号为不可恢复的操作，注销账号后你将无法再使用本货代Go账号或找回你浏览、关注、添加、绑定的任何内容或信息(即使你使用相同的手机号码再次注册并使用货代Go)
            建议你在注销前自行备份货代Go账号相关的所有信息，并请确认与本货代Go账号相关的所有服务均已进行妥善处理。注销成功后，我们将删除你的个人信
            息，或对其进行匿名化处理。请你知悉并理解，根据相关法律法规规定相关日志记录货代Go将保留不少于6个月的时间。
          </Text>
          <Text>
            1.我们对你注销货代Go账号的决定深表遗憾。如果你仍执意注销账号，你的账号需同时满足以下条件：
          </Text>
          <Text>1.1账号处于安全状态：账号处于正常使用状态，无被盗风险。</Text>
          <Text>
            1.2账号财产已结清，没有未完成和/或存在争议的服务：账号中没有资产、欠款、未结清的资金和虚拟权益；本账号及通过本账号接入的第三方中没有未完成和/或存在争议的服务。
          </Text>
          <Text>
            1.3账号权限解除：账号已解除与其他产品、网站授权登录或绑定关系。
          </Text>
          <Text>1.4账号无任何纠纷，包括投诉举报或被投诉举报。</Text>
          <Text>
            2.在你的账号注销期间，如果你的账号涉及争议纠纷，包括但不限于：投诉、举报、诉讼、仲裁、国家有权机关调查等，你知晓并理解，货代Go有权自行决定是否终止本账号的注销而无需另行得到你的同意。
          </Text>
          <Text>
            3.注销货代Go账号，你将无法再使用本货代Go账号，也将无法找回本货代Go账号中及与账号相关的任何内容或信息，包括但不限于：
          </Text>
          <Text>
            3.1本货代Go账号的个人资料和历史信息(包括但不限于头像、用户名、发布内容、浏览记录、关注、收藏等)都将无法找回；
          </Text>
          <Text>
            3.2你将无法登录、使用本货代Go账号，你的粉丝将无法继续关注你或通过本账号与你互动；
          </Text>
          <Text>
            3.3你通过本货代Go账号使用、授权登录或绑定本货代Go账号后使用的货代Go或第三方服务的相关记录将无法找回。你将无法再登录、使用上述服务，你曾获得的虚拟权益等财产性利益视为你自动放弃，将无法继续使用。你理解并同意，货代Go无法协助你重新恢复上述服务。
          </Text>
          <Text>
            4.注销本货代Go账号并不代表注销前的账号中的行为和相关责任得到豁免或减轻。
          </Text>
          <Text>
            （三）
            在部分场景中，您可以通过设备或操作系统的设置主动的授权或撤销授权货代Go获取您的个人信息。
            请您理解，当您撤回授权或不予授权货代Go获取您的这部分个人信息时，货代Go无法继续为您提供必需这部分信息的对应服务。
            但您撤回授权的决定，不会影响此前基于您的授权而开展的个人信息处理。
          </Text>
          <Text>
            （四）
            你可以按照货代Go公示的制度进行投诉或举报。如果你认为你的个人信息权利可能受到侵害，
            或者发现侵害个人信息权利的线索，你可以联系货代Go官方客服提交投诉或者举报信息。我们核查后会在15日内反馈你的投诉与举报。
          </Text>
          <Text>在以下情形中，货代Go无法对您的请求进行响应：</Text>
          <Text>(1) 与国家安全、国防安全有关的；</Text>
          <Text>(2) 与公共安全、公共卫生、重大公共利益有关的；</Text>
          <Text>(3) 与犯罪侦查、起诉和审判等有关的；</Text>
          <Text>(4) 有充分证据证明您存在主观恶意或滥用权利的；</Text>
          <Text>
            (5) 响应您的请求将导致其他个人、组织的合法权益受到严重损害的；
          </Text>
          <Text>(6) 应国家有权机关的要求的；</Text>
          <Text>(7) 法律法规规定的其他情形。</Text>
        </View>
        <View className="title-text">
          <Text>六、本政策的适用、修订和通知</Text>
        </View>
        <View className="default-text">
          <Text>
            本隐私政策是货代Go统一使用的隐私条款，货代Go所有产品与/或服务均适用本政策。
            在货代Go部分的其他产品与/或服务中，可能会有其产品与/或服务特定的隐私政策，这些特定的隐私政策将更具体地说
            明货代Go在其中如何使用您的信息，且这些特定的隐私政策是本政策不可分割的一部分；如果这些产品与/或服务中特定
            的隐私政策与本政策有不一致之处，以该特定的产品与/或服务的隐私政策为准。
          </Text>
          <Text>
            随着货代Go业务的发展，货代Go的产品与/或服务会发生升级和调整，
            货代Go可能会依据功能调整、使用规则变更、适用法律法规变更或监管要求变更等的情形适时对本政策进行修订。
          </Text>
          <Text>
            一旦货代Go对本政策进行了修订，货代Go会通过货代Go的产品与/或服务向您提示相关内容的更新。
            对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于邮件、短信、私信或在浏览页面做特别提示等方式，
            说明隐私政策的具体变更内容）。同时，也请您关注货代Go以便及时了解最新的隐私政策。
          </Text>
          <Text>
            如果您在本政策修订后继续使用货代Go的产品与/或服务，则表示您已经充分阅读、理解并接受修订后的隐私政策，且愿意接
            受修订后政策的约束，否则您将无法继续使用货代Go的产品与/或服务。如果更新的内容需要采集音视频、获取你通讯录、联系方式、
            地理位置等个人敏感信息，仍会再次以显著方式征求你的同意。
          </Text>
        </View>
        <View className="title-text">
          <Text>七、关于未成年人信息的保护</Text>
        </View>
        <View className="default-text">
          <Text>
            货代Go十分重视未成年人个人信息的保护。如果您是年龄未满18周岁的未成年人，
            您应当请您的父母或监护人阅读本政策。在征得您父母或监护人明确或书面同意本隐私政策内容前，
            您应当停止使用货代Go的产品与/或服务。如您的父母或监护人不同意您按照本政策使用货代Go的产品与
            /或服务或向货代Go提供信息，请您立即终止使用货代Go的产品与/或服务，
            并及时通知货代Go，以便货代Go采取相应的措施。
          </Text>
        </View>
        <View className="title-text">
          <Text>八、术语释义</Text>
        </View>
        <View className="default-text">
          <Text>
            （一）货代Go的产品与/或服务是通过合法拥有并运营的、
            标注名称为“货代Go”的APP应用程序，向你提供的产品与服务，
            包括但不限于物流信息查询、货代服务预订等功能。
          </Text>
          <Text>
            （二）
            本政策所称个人信息是指，以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息，主要包括：
          </Text>
          <Text>
            (1)
            个人基本信息（包括个人姓名、生日、性别、地址、电话号码、电子邮箱、面部特征）；
          </Text>
          <Text>(2) 个人身份信息（身份证等有效证件信息）；</Text>
          <Text>
            (3)
            网络身份标识信息（包括账号名、账号昵称、IP地址、邮箱地址、前述相关的密码、口令、密保信息等）；
          </Text>
          <Text>
            (4)
            个人财产信息（交易记录、消费记录、申请信贷记录、银行卡信息，以及资金账户余额（如有）、积分、参加的课程等虚拟财产信息）；
          </Text>
          <Text>(5)个人社交信息（通信录、好友关注等）</Text>
          <Text>
            (6) 个人上网记录（网站浏览记录、软件使用记录、点击记录等）；
          </Text>
          <Text>
            (7)
            个人设备信息（包括硬件型号、设备硬件参数、操作系统类型和基本信息、软件唯一设备识别码、SIM卡信息等在内的个人常用设备信息）；
          </Text>
          <Text>(8) 个人位置信息（包括位置信息、运动记录等）。</Text>
          <Text>
            （三）个人敏感信息是指，一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身
            心健康受到损害或歧视性待遇等的个人信息。本隐私政策中的个人敏感信息包括：包括个人身份信息（身份证件号码
            ，包括身份证、军官证、护照、驾驶证）；面部特征；财产信息、交易信息；网络身份识别信息（包括账号名、账号昵称
            、邮箱地址以及与前述有关的密码与密码保护问题和答案）；其他信息（包括通信录、个人电话号码、行程信息、精准定位信息）。
          </Text>
          <Text>
            （四）去标识化是指，通过对个人信息的技术处理，使其在不借助额外信息的情况下，无法识别个人信息主体的过程。
          </Text>
          <Text>
            （五）匿名化是指，通过对个人信息的技术处理，使得个人信息主体无法被识别，且处理后的信息不能被复原的过程。
          </Text>
          <Text>
            如对本隐私政策内容有任何疑问、意见或建议，你可通过登录货代Go微信公众号联系我们的官方客服，我们将在7个工作日内给您答复。
          </Text>
          <Text>（完）</Text>
        </View>
      </View>
    </View>
  );
};

export default Privacy;
